# ServiceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ServiceType Property
FabricationPart Class See Also
---
The service type identifier of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int ServiceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceType As Integer
	Get
```

Visual C++
---
```text
public:
property int ServiceType {
	int get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace